In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name": ["Harry", "Ron", "Hermione", "Neville"],
    "Marks": [92, 78, 89, 77],
    "City": ["Kolkata", "Delhi", "Mumbai", "Chennai"]
}

In [3]:
df = pd.DataFrame(dict1) # Creating a DataFrame from a dictionary

In [4]:
df

       Name  Marks     City
0     Harry     92  Kolkata
1       Ron     78    Delhi
2  Hermione     89   Mumbai
3   Neville     77  Chennai

In [5]:
df.to_csv("friends.csv") # Save the DataFrame to a CSV file (with index)

In [6]:
df.to_csv("friends_index_false.csv", index=False) # Save the DataFrame to a CSV file without the index

In [7]:
df.head(2) # Display the first 2 rows

    Name  Marks     City
0  Harry     92  Kolkata
1    Ron     78    Delhi

In [8]:
df.tail(2) # Display the last 2 rows

       Name  Marks     City
2  Hermione     89   Mumbai
3   Neville     77  Chennai

In [9]:
df.describe() # Display the statistical analysis of the DataFrame

           Marks
count   4.000000
mean   84.000000
std     7.615773
min    77.000000
25%    77.750000
50%    83.500000
75%    89.750000
max    92.000000

In [10]:
Practice = pd.read_csv("practice.csv") # Read a CSV file

In [11]:
Practice

   Unnamed: 0  Train No  Speed     City
0           0     12345    100    Pune
1           1     21345     89   Nagpur
2           2     31245     76   Mumbai
3           3     41235     48    Delhi
4           4     51234     81  Nashisk

In [12]:
Practice["Speed"] # Display the Speed column

0    100
1     89
2     76
3     48
4     81
Name: Speed, dtype: int64

In [42]:
Practice["Speed"][0] # Display the first element of the Speed column

np.int64(100)

In [14]:
Practice["Speed"][0] = 100 # Change the first element of the Speed column

C:\Users\Dev\AppData\Local\Temp\ipykernel_42328\1106167978.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Practice["Speed"][0] = 100 # Change the first element of the Speed column

In [15]:
Practice["Speed"][0] # Display the first element of the Speed column

np.int64(100)

In [16]:
Practice.to_csv("practice.csv") # Save the DataFrame to a CSV file

In [17]:
ser = pd.Series(np.random.rand(34)) # Create a Series

In [18]:
ser

0     0.925498
1     0.767434
2     0.089307
3     0.204574
4     0.679589
5     0.009930
6     0.595348
7     0.027520
8     0.834442
9     0.902515
10    0.448169
11    0.124822
12    0.478148
13    0.332586
14    0.520534
15    0.554538
16    0.865406
17    0.782949
18    0.559870
19    0.192914
20    0.355984
21    0.875553
22    0.461328
23    0.210954
24    0.643532
25    0.243625
26    0.408327
27    0.030103
28    0.721850
29    0.049469
30    0.082144
31    0.679706
32    0.323685
33    0.442065
dtype: float64

In [19]:
type(ser)  # Display the type of the Series

pandas.core.series.Series

In [20]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334)) # Create a DataFrame with 334 rows and 5 columns

In [21]:
newdf

            0         1         2         3         4
0    0.935662  0.951350  0.706825  0.445517  0.326447
1    0.073751  0.759603  0.679595  0.262759  0.665287
2    0.994700  0.298295  0.730374  0.484977  0.584885
3    0.084266  0.069047  0.094676  0.625589  0.116844
4    0.657389  0.783852  0.589908  0.597883  0.790147
..        ...       ...       ...       ...       ...
329  0.988706  0.767065  0.297549  0.282334  0.881294
330  0.235060  0.177765  0.813673  0.638255  0.027898
331  0.195370  0.058066  0.546325  0.269286  0.672166
332  0.961380  0.821895  0.454688  0.175915  0.664354
333  0.458889  0.710466  0.839311  0.779422  0.782827

[334 rows x 5 columns]

In [22]:
type(newdf) # Display the type of the DataFrame

pandas.core.frame.DataFrame

In [23]:
newdf.describe() # Display the statistical analysis of the DataFrame

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.499297    0.498884    0.494718    0.498628    0.512342
std      0.293527    0.294688    0.293481    0.294403    0.288607
min      0.001047    0.001327    0.000159    0.001612    0.001001
25%      0.220444    0.230162    0.247130    0.231495    0.286541
50%      0.496429    0.493305    0.456942    0.503645    0.514390
75%      0.755143    0.763808    0.761131    0.747216    0.769128
max      0.994700    0.999609    0.999981    0.999858    0.996640

In [24]:
newdf.head(2) # Display the first 2 rows

          0         1         2         3         4
0  0.935662  0.951350  0.706825  0.445517  0.326447
1  0.073751  0.759603  0.679595  0.262759  0.665287

In [25]:
newdf.dtypes # Display the data types of the DataFrame

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
newdf[0][0] = "Harry" # Change the first element of the first column

C:\Users\Dev\AppData\Local\Temp\ipykernel_42328\4026468265.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "Harry" # Change the first element of the first column
C:\Users\Dev\AppData\Local\Temp\ipykernel_42328\4026468265.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "Harry" # Change the first element of the first column

In [27]:
newdf.head(2) # Display the first 2 rows

          0         1         2         3         4
0     Harry  0.951350  0.706825  0.445517  0.326447
1  0.073751  0.759603  0.679595  0.262759  0.665287

In [28]:
newdf.dtypes # Display the data types of the DataFrame

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdf.index # Display the index of the DataFrame

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [30]:
newdf.columns # Display the columns of the DataFrame

RangeIndex(start=0, stop=5, step=1)

In [31]:
newdf.to_numpy() # Convert the DataFrame to a NumPy array

array([['Harry', 0.9513501277103921, 0.7068251876485947,
        0.44551742767834024, 0.32644688311315395],
       [0.07375067713887873, 0.7596034702102572, 0.6795947230210168,
        0.2627585962010305, 0.6652865624771326],
       [0.9946997082673701, 0.298294841269772, 0.7303736154714501,
        0.4849767052897427, 0.584884851328881],
       ...,
       [0.19536990987983371, 0.05806626446569951, 0.5463253709279763,
        0.26928593587142347, 0.6721661507199297],
       [0.9613804284917215, 0.8218947195990915, 0.4546881839859953,
        0.17591479094562634, 0.664354010351284],
       [0.4588892091163713, 0.7104656312712937, 0.8393107766919309,
        0.7794216096040755, 0.7828271963819627]],
      shape=(334, 5), dtype=object)

In [32]:
newdf[0][0] = 34 # Change the first element of the first column

In [33]:
newdf.head(2) # Display the first 2 rows

          0         1         2         3         4
0        34  0.951350  0.706825  0.445517  0.326447
1  0.073751  0.759603  0.679595  0.262759  0.665287

In [34]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0          34  0.951350  0.706825  0.445517  0.326447
1    0.073751  0.759603  0.679595  0.262759  0.665287
2      0.9947  0.298295  0.730374  0.484977  0.584885
3    0.084266  0.069047  0.094676  0.625589  0.116844
4    0.657389  0.783852  0.589908  0.597883  0.790147
..        ...       ...       ...       ...       ...
329  0.988706  0.767065  0.297549  0.282334  0.881294
330   0.23506  0.177765  0.813673  0.638255  0.027898
331   0.19537  0.058066  0.546325  0.269286  0.672166
332   0.96138  0.821895  0.454688  0.175915  0.664354
333  0.458889  0.710466  0.839311  0.779422  0.782827

[334 rows x 5 columns]>

In [35]:
newdf.T # Transpose the DataFrame

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,34,0.073751,0.9947,0.084266,0.657389,0.613926,0.338483,0.628925,0.937134,0.388025,...,0.485939,0.787704,0.166227,0.753532,0.415118,0.988706,0.23506,0.19537,0.96138,0.458889
1,0.95135,0.759603,0.298295,0.069047,0.783852,0.252785,0.111537,0.411087,0.138183,0.434154,...,0.123478,0.793752,0.996087,0.020512,0.525204,0.767065,0.177765,0.058066,0.821895,0.710466
2,0.706825,0.679595,0.730374,0.094676,0.589908,0.642813,0.276358,0.83091,0.226755,0.423385,...,0.073197,0.09672,0.169402,0.273245,0.693094,0.297549,0.813673,0.546325,0.454688,0.839311
3,0.445517,0.262759,0.484977,0.625589,0.597883,0.873459,0.947654,0.951521,0.50379,0.245812,...,0.015202,0.77573,0.606681,0.711903,0.654463,0.282334,0.638255,0.269286,0.175915,0.779422
4,0.326447,0.665287,0.584885,0.116844,0.790147,0.498842,0.073556,0.327266,0.060249,0.307318,...,0.769313,0.529425,0.311973,0.334274,0.442566,0.881294,0.027898,0.672166,0.664354,0.782827

In [36]:
newdf.head() # Display the first rows

          0         1         2         3         4
0        34  0.951350  0.706825  0.445517  0.326447
1  0.073751  0.759603  0.679595  0.262759  0.665287
2    0.9947  0.298295  0.730374  0.484977  0.584885
3  0.084266  0.069047  0.094676  0.625589  0.116844
4  0.657389  0.783852  0.589908  0.597883  0.790147

In [37]:
newdf.sort_index(axis=1, ascending=False) # Sort the DataFrame by index (axis=1 is column and azis=0 is row)

            4         3         2         1         0
0    0.326447  0.445517  0.706825  0.951350        34
1    0.665287  0.262759  0.679595  0.759603  0.073751
2    0.584885  0.484977  0.730374  0.298295    0.9947
3    0.116844  0.625589  0.094676  0.069047  0.084266
4    0.790147  0.597883  0.589908  0.783852  0.657389
..        ...       ...       ...       ...       ...
329  0.881294  0.282334  0.297549  0.767065  0.988706
330  0.027898  0.638255  0.813673  0.177765   0.23506
331  0.672166  0.269286  0.546325  0.058066   0.19537
332  0.664354  0.175915  0.454688  0.821895   0.96138
333  0.782827  0.779422  0.839311  0.710466  0.458889

[334 rows x 5 columns]

In [38]:
newdf.head() # Display the first rows

          0         1         2         3         4
0        34  0.951350  0.706825  0.445517  0.326447
1  0.073751  0.759603  0.679595  0.262759  0.665287
2    0.9947  0.298295  0.730374  0.484977  0.584885
3  0.084266  0.069047  0.094676  0.625589  0.116844
4  0.657389  0.783852  0.589908  0.597883  0.790147

In [39]:
newdf[0]

0            34
1      0.073751
2        0.9947
3      0.084266
4      0.657389
         ...
329    0.988706
330     0.23506
331     0.19537
332     0.96138
333    0.458889
Name: 0, Length: 334, dtype: object

In [40]:
type(newdf[0]) # Display the type of the column

pandas.core.series.Series